In [2]:
import pandas as pd
df = pd.read_csv('exam.csv')

df = df.assign(mean = lambda x : (x['math']+x['english']+x['science'])/3)
df.head()

   id  nclass  math  english  science       mean
0   1       1    50       98       50  66.000000
1   2       1    60       97       60  72.333333
2   3       1    45       86       78  69.666667
3   4       1    30       98       58  62.000000
4   5       2    25       80       65  56.666667

In [3]:
df.agg(mean_math = ('math','mean'))

            math
mean_math  57.45

In [4]:
df['math'].mean()

57.45

In [13]:
df.groupby('nclass')\
    .agg(mean_math = ('math','mean'))
# nclass 별로 분리
# math 평균 구하기

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [14]:
df.groupby('nclass', as_index = False)\
            .agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

In [15]:
df.groupby('nclass')\
    .agg(mean_math = ('math','mean'),   # 수학 점수 평균
        sum_math = ('math','sum'),      # 수학 점수 합계
        median_math = ('math','median'),# 수학 점수 중앙값
        n = ('nclass','count'))         # 빈도(학생 수)

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [16]:
df.groupby('nclass').mean()

          id   math  english  science       mean
nclass
1        2.5  46.25    94.75    61.50  67.500000
2        6.5  61.25    84.25    58.25  67.916667
3       10.5  45.00    86.50    39.25  56.916667
4       14.5  56.75    84.75    55.00  65.500000
5       18.5  78.00    74.25    83.25  78.500000

In [1]:
df

NameError: name 'df' is not defined